# 1) შექმენით 2 ცვლადი, სახელად num1 და num2, შემდეგ შექმენით მესამე ცვლადი, სახელად sum (ჯამი), რომელიც შეინახავს ამ ორი ცვლადის ჯამს, საბოლოოდ დაპრინტეთ ცვლადი, sum.
num1 = 456
num2 = 782
sum = num1 + num2
print(sum)

# 2) შექმენით ცვლადი სახელად price (ფასი), რომელიც თავიდანვე უდრის 50, შემდეგ გაანახლეთ ამ ცვლადის მნიშვნელობა, და გახადეთ 80. საბოლოოდ დაპრინტეთ ცვლადი, price
price = 50
price = 80
print(price)

# 3) მომხმარებელს შემოატანინეთ ჯერ სახელი რომელსაც შეინახავთ name ცვლადში შემდეგ კი ასაკი რომსაც შეინახავთ age ცვლადში შემდეგ გამოიტანეთ ჯერ სახელი და შემდეგ ასაკი 

# 4) კომენტარის სახით ახსენი, თუ რა არის debugging
# Bug არის პირდაპირ თარგმანში მწერი, მაგრარმ პროგრამინგში ნიშნავს გაჭედვას, და Debugging ნიშნავს გაჭედვის შესწორებას

# 5) კომენტარის სახით ახსენით რაში გამოიყენება კომეტარები და რისთვის გვჭირდება "განმარტება დაწერეთ ვრცლად"
# პროგრამინგში ვიყენებთ კომენტარებს რომ ავხსნათ რა რას აკეთებს. შენი სურვილია, გინდა თუ არა გამოყენება, მაგრამ ჯობია გამოყენება, რომ მივხვდეთ კოდი რას შვება.
# კომპიუტერი კომენტარებს არ ჰკითხულობენ. მაგალითად, კომენტარის სახით რომ დაწერო print("Hello World") არ წაიკითხავს და არ გამოიყვანს ტერმინალში.

# 6) შექმენით 2 ერთი და იგივე სახელის ცვლადი ისე რომ ინფორმაცია არ განახლდეს

model = "Jeep Wrangler"
Model = "Hummer H3"