# 1) რას ნიშნავს კონკატენაცია ახსენით კომენტარის სახით.
# კონკატენაცია არის როდესაც 2 სტრინგზე აკეთებ მიმატებას

# 2) რას გამოიტანს ეს კოდი:

# name = "giorgi"
# age = 15 

# print(name + age)

# პასუხი დაასაბუთეთ ვრცლად კომენტარის სახით.
# ეს გამოიტანს giorgi15'ს რადგან ამ კოდში არის კონკატენაცია გამოყენებული

# 3) შექმენით 5 ცვლადი რომელშიც შენახავთ სხვადასხვა მონაცემის ტიპის მქონე ელემენტებს და დაპრინტეთ თითოეულის მონაცემთა ტიპი.
box = "Hammer"
backpack = "Book"
notebook = 25.9
book = 8
paper = 72
print(type(box)) # string
print(type(backpack)) #string
print(type(notebook)) # float
print(type(book)) # integer
print(type(paper)) # integer

# 4) შექმენით 2 ცვლადი num1 და num2 შემდეგ num1 გაყავით num2'ზე და დააბრუნეთ მიღებული რიცხვის მონაცემთა ტიპი.
num1 = 44
num2 = 2
print(num1 / num2)
# ამის პასუხი იქნება float-ი (22.0)

# 5) შექმენით 2 ცვლადი word და num word ცვლადში შეინახეთ თქვენთვის სასურველი სიტყვა num ცვლადში თქვენთვის სასურველი რიცხვი შემდეგ ეს სიტყვა გაამრავლეთ ამ რიცხვზე და დაპრინტეთ შედეგი.
word = "Hello!"
num = 69
print(word * num)