#1)ახსენით რაში ვიყენებთ ცვლადებს.
# ცვლადებს ვიყენებთ რომ შევინახოთ მონაცემენბი

# 2)ახსენით რა არის ცვლადის მნიშვნელობის განახლება და როგორ მუშაობს იგი.
# ცვლადების განახლება არის როდესაც 2 ცვლადს იგივე სახელი ჰქვია და printს თუ უზავ, ყველაზე ახალ შექმნილ ცვლადს გამოიტანს

# 3)შექმენი ცვლადი, სადაც შეინახავ შენს ასაკს და დაბეჭდე რამდენი წლის იქნები 5 წელში.
age = 11
print(age + 5)

# 4)შექმენი 3 ცვლადი, პირველში შიენახეთ თქვენი ასაკი, მეოერში შეინახეთ თქვენი საყვარელი რიცხვი, ხოლო მესამე ცვლადში შეინახეთ პირველი ცვლადი გაყოფილი მეორე ცვლადზე.
age = 11
favourite = 64
print(age / favourite)

# 5)შექმენით ცვლადი, სადაც შეინახავთ თქვენს სახელს, შემდეგ 3-ჯერ შეიცვალეთ მას მნიშვნელობა და მიანიჭეთ სხვადასხვა  სახელები. 
name = "niko"
name = "gio"
name = "ako"
print(name)