# 1) while loop ს მეშვეობით გამოიტანეთ თქვენი სახელი 10-ჯერ 

i = 0
while i < 10:
    print("Nikoloz")
    i = + 1

# 2) while loop ის მეშვეობით გამოიტანეთ რიცხვები 10 ის ჩათვლით 

i = 1
while i <= 10:
    print(i)
    i = + 1

# 3) while loop ის მეშვეობით გამოიტანეთ რიცხვები 0 დან 100 მდე

i = 0
while i <= 100:
    print(i)
    i = + 1

# 4) შექმენით ცვლადი სადაც შეინახავთ თქვენს ასაკს შემდეგ if else 'ს გამოყენებით შეამოწმეთ შემდეგი რამ თუ age >= იქნება 18 ის მაშინ დაპრინტეთ 
# "თქვენ იხდით სტანდარტული ფასებით" სხვა შემთხვევაში დაპრინტეტ "შენ მიიღე ფასდაკლება"

age = 12
if age >= 18:
    print("You pay standard prices.")
else:
    print("You got a discount")

# 5) შექმენით ცვლადი სადაც მომხმარებელს შემოატანინებთ თავის ასაკს თუ მომხმარებლის ასაკი მეტი იქნება 18 ძე მაშინ გამოიტანეთ "კეთილი იყოს შენი მობრძანება" 
# სხვა შემთხვევაში "შენ ხარ არასრულწლოვანი"

age = int(input("Enter your age: "))
if age > 18:
    print("You are welcome.")
else:
    print("You are underage.")
