# 1) შექმენით ფუნქცია რომელსაც გადასცემთ ერთ პარამეტრს age 'ს თუ age აღემატება 18 მაშინ დაპრინტეთ "შენ ხარ სრულწლოვანი" სხვაშემთხვევაში "შენ არხარ სრულწლოვანი"

def check_age(age):
    if age > 18:
        print("შენ ხარ სრულწლოვანი")
    else:
        print("შენ არ ხარ სრულწლოვანი")

# 2) კომენტარის სახით ახსენით რას ნიშნავს და რაში გამოიყენება if-else სთეითმენთი 

# if-else statement გამოიყენება იმისთვის, რომ პროგრამამ პირობის მიხედვით შეასრულოს სხვადასხვა მოქმედება.
# თუ if-ში მოცემული პირობა ჭეშმარიტია, სრულდება მისი კოდი, ხოლო თუ მცდარია — სრულდება else-ში არსებული კოდი.

# 3) კომენტარის სახით ახსენით while loop'ები 

# while loop გამოიყენება კოდის განმეორებით შესასრულებლად მანამ,
# სანამ მოცემული პირობა True (ჭეშმარიტი) იქნება.
# როდესაც პირობა გახდება False, ციკლი შეწყდება.

# 4) while loop ის დახმარებით გამოიტანეთ რიცხვები 100 დან 0 'ის ჩათვლით 

count = 100 
while count >= 0:
    print(count)
    count -= 1 

# 5) შექმენით ცვლადი სადაც მომხმარებელს შემოატანინებთ მის ასაკს თუ მისი ასაკი აღემატება ან ტოლია 18 მაშინ დაპრინტეტ "თქვენ გადაიხდით რეგულარული ფასებით" სხვა შემთხვევაში დაპრინტეთ "თქვენ მიიღეთ 20% ფასდაკლება"

age = int(input("შეიყვანეთ თქვენი ასაკი: "))
if age >= 18:
    print("თქვენ გადაიხდით რეგულარული ფასებით")
else:
    print("თქვენ მიიღეთ 20% ფასდაკლება")