 #1) კომენტარის სახით ახსენით რაში გვჭირდება elif.

# elif

#2) for loop-ის გამოყენებით გამოიტანეთ ყველა კენტი რიცხვი 20-დან 100-მდე.

#3) შექმენით password ცვლადი სადაც შეინახავთ რაიმე პაროლს, შემდეგ მომხმარებელს შემოატანინეთ პაროლი, სანამ  პაროლები არ დაემთხვევა გამოიტანეთ: "incorrect password" და თავიდან შემოაყვანინეთ პაროლი. , ხოლო თუ  დაემთხვევა გამოიტანეთ: "password is correct".  გამოიყენეთ  while loop  და if/elif/else.

#4) while loop-ის დახმარებით გამოიტანეთ ყველა ლუწი რიცხვი 100-დან 20-მდე.