#2) დაწერეთ დღეს ნასწავლი ყველა მონაცემთა ტიპი.
# ჩვენ გვაქვს 3 მთავარი მონაცემთა ტიპი, რომელიც არის string, integer და float.
# string არის ტექსტი ბრჭყალებში, integer არის მთელი რიცხვები და float არის წილადები.

# 3) მომხმარებელს შემოატანინეთ რიცხვი და გადააქციეთ ინტეჯერად.
# "5" = 5

# 4) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ მისი მონაცემთა ტიპი.
print(type(5.43))

#  5) შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს შემდეგ მომხმარებელს შემოატანინეთ თავისი სახელი და თქვენს ჩვლადს დაუმატეთ მომხმარებლის შემოტანილი სახელი.
myname = "Niko"
name = "Gio"
print(myname + name)

# 6) შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს შემდეგ მომხმარებელს შემოატანინეთ თავისი სახელი და თქვენს ჩვლადს დაუმატეთ მომხმარებლის შემოტანილი სახელი.
print(1004 / 2)
# 502.0

# 7) შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს შემდეგ მომხმარებელს შემოატანინეთ რიცხვი ინტეჯერის სახით და თქვენი სახელი გაამრავლეთ ამ რიცხვზე.
myname = "Niko"
print(myname * 9) 
# NikoNikoNikoNikoNikoNikoNikoNikoNiko