# 1) კომენტარის სახით ახსენით რა არის დეკლარირება

# ცვლადის დეკლარირება ნიშნავს მის გამოცხადებას პროგრამაში

# 2) შექმენით 2 ცვლადი name და surname შემდეგ კი მომხმარებელს შემოატანინეთ თავისი სახელი და გვარი ბოლოს კი გამოიტანეთ მოხმარებლის სახელი და გავარი ერთად.

name = input("Enter your name: ")     
surname = input("Enter your surname: ")  

print("Your name and surname is:", name, surname)


# 3) შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ დაა-update-ეთ ამ ცვლადის მნიშვნელობა, რამოდენიმეჯერ. საბოლოოდ კი დაპრინტეთ ეს ცვლადი

points = 50
points = 100
points = 150
points = 200

# 4) გაასწორეთ შემდეგი კოდი:
#      1age == 156
#      print(("1age)

age = 156
print(age)

# 5) დაწერეთ პროგრამა, რომელიც შეიცავს ორ integer ტიპის ცვლადს (მაგალითად, a და b), შემდეგ გამოიანგარიშეთ ამ ცვლადების ჯამი, სხვაობა, ნამრავლი და განაყოფი. 

a = 5
b = 10

print(a + b) # 15
print (a - b) # -5
print (a * b) # 50
print (a / b) # 0.5

# 6) დაწერეთ კოდი შეცდომებით და ქვემოთ მიუწერეთ მისი სწორი ვერსია.

# 2pac == rap
# print(2pac))
pac2 = "rap"
print(pac2)