# 1) შექმენით ცვლადი name სადაც გექნებათ თქვენი სახელი ხოლო, შემდეგ განაახლეთ ამ ცვლადის მნიშვნელობა
name = "gio"
name = "niko"



# 2) print ფუნქციის გამოყენებით მოახდინეთ მათემატიკური ოპერაციები დღევანდელი ნასწავლი მასალით. მიმატება გამოკლება გამრავლება და გაყოფა
print(8 + 4)
print(8 - 4)
print(8 * 4)
print(8 / 4)

# 3) შექმენით ცვლადი სახელად num ამ ცვლადში შეინახეთ თქვენთვის სასურველი რიცხვი. და მაგ რიცხვის მნიშვნელობას დაემატოს ( 1 ) თუ არის 10 გახდეს 11
num = 33
print(num + 1)

# 4) კომენტარების სახით ახსენით არის თუ არა სასარგებლო ცვლადის, განახლება და თუ ფიქრობთ რომ კი მაშინ რატომ?
#?